Catalogs/ПериодыДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПериодыДействия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Астрономические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комбинированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.МесяцаГода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДняНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМесяцаГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Периодические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.МесяцаГода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПериодыДействия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодическиеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если Не ОтменаРедактирования Тогда
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(Элементы.Периодические.ТекущиеДанные, "МесяцГода,ДеньНедели,ВремяНачала,ВремяОкончания") Тогда
			Объект.Периодические.Удалить(Элементы.Периодические.ТекущаяСтрока);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПериодическиеПередОкончаниемРедактирования()

&НаКлиенте
Процедура ПериодическиеВремяНачалаПриИзменении(Элемент)

	Элементы.Периодические.ТекущиеДанные.ВремяНачала = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Периодические.ТекущиеДанные.ВремяНачала, 300);
	
КонецПроцедуры	// ПериодическиеВремяНачалаПриИзменении()

&НаКлиенте
Процедура ПериодическиеВремяОкончанияПриИзменении(Элемент)

	Элементы.Периодические.ТекущиеДанные.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Периодические.ТекущиеДанные.ВремяОкончания, 300);
	
КонецПроцедуры // ПериодическиеВремяОкончанияПриИзменении()

&НаКлиенте
Процедура АстрономическиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Не ОтменаРедактирования Тогда
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(Элементы.Астрономические.ТекущиеДанные, "ДатаНачала,ДатаОкончания,ВремяНачала,ВремяОкончания") Тогда
			Объект.Астрономические.Удалить(Элементы.Астрономические.ТекущаяСтрока);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // АстрономическиеПриОкончанииРедактирования()

&НаКлиенте
Процедура АстрономическиеВремяНачалаПриИзменении(Элемент)

	//Элементы.Астрономические.ТекущиеДанные.ВремяНачала = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Астрономические.ТекущиеДанные.ВремяНачала, 300); //Костенюк Александр-Закомментировано 26.05.2016
	
КонецПроцедуры // АстрономическиеВремяНачалаПриИзменении()

&НаКлиенте
Процедура АстрономическиеВремяОкончанияПриИзменении(Элемент)

	//Элементы.Астрономические.ТекущиеДанные.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Астрономические.ТекущиеДанные.ВремяОкончания, 300); //Костенюк Александр-Закомментировано 26.05.2016
	
КонецПроцедуры // АстрономическиеВремяОкончанияПриИзменении()
